HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_dci.c
/**
 *******************************************************************************
 * @file  foc_dci.c
 * @brief FOC 模式28 — 功角参考电流闭环实现（第 2 步：P-only 电流环；
 *        第 1 步复刻 mode 27 + foc_calib 零偏窗已实测验收）。
 *
 *        流程：零矢量零偏校准（foc_calib，丢弃 10ms + 平均 200ms，锁三相
 *              零偏）-> 校准 BETA(2s, 90°) -> ALPHA(2s, 0°, 锁零点 offset)
 *              （校准吸附仍是电压开环，Dci_OutputField）
 *              -> RUN（电流环）：delta 照常爬坡（init/targ/tr），到点置
 *                 RAMP_DONE 一次；电流参考 id_ref = I_ref·cosδ,
 *                 iq_ref = I_ref·sinδ（δ = 参考电流矢量方向，δ=90° 即
 *                 id_ref=0 经典 FOC）；vd/vq = PID_UpdateUs 输出
 *                 （i_valid=false 仅 P，限幅 ±DCI_PI_UMAX_V），反 Park 在
 *                 转子角 -> SVPWM。转速 = 力矩平衡结果（参考力矩 > 摩擦时
 *                 加速至 PI 电压饱和后电流 droop、力矩回落平衡）。
 *
 *        电流路径：
 *          锁定零偏后每拍构造 dataCal 副本（三相减 g_calib_*_off_ma），
 *          所有 Clarke/Park 用 dataCal；OC 保护仍用原始 pData。
 *          RUN 控制系 = 转子系：Park（反馈）与反 Park（输出）都在转子角。
 *
 *        输出约定：
 *          BETA/ALPHA（电压开环）：磁场角 fa 直接作为控制变量
 *          valpha=V·cos(fa), vbeta=V·sin(fa)，theta = fa - 90°。
 *          RUN（电流环）：vd/vq 为 PI 输出（g_foc_vd/vq 首次成为真实
 *          d/q 轴电压），g_foc_theta_rad = 转子角，g_foc_id/iq_ma 与
 *          g_dci_id/iq_ma 同源（= 环反馈）。
 *
 *        角度框架（增量累积式，与 mode 27 相同）：
 *          每拍 wrap-safe 差分 -> ±DCI_ENC_DELTA_MAX(32) counts 限幅
 *          -> s_enc_pos 累加 -> 转子电角 =
 *             mod((s_enc_pos - s_off_rel) × 编码器方向, CPR) × 360°×极对数/CPR
 *          s_off_rel = ALPHA 锁零点瞬间的 s_enc_pos（锁相瞬间转子角=0）。
 *
 *        ISR 内禁止打印：事件经 g_dci_evt、周期数据经 Watch 观测量
 *        由 foc_obs 在主循环完成。
 *******************************************************************************
 */

#include "foc_dci.h"
#include "foc_calib.h"
#include "foc_math.h"
#include "tmr4_pwm.h"
#include "encoder.h"
#include "motor_config.h"
#include "hc32_ll_tmra.h"       /* TMRA_GetCountValue(CM_TMRA_1) */

#define FOC_ISR_DT_US  (1000000u / FOC_ISR_HZ)   /* PI 积分离散步长 (us) */

/* 阶段时长/窗口 -> ISR tick 数 */
#define DCI_BETA_TICKS    ((uint32_t)DCI_BETA_MS    * (uint32_t)FOC_ISR_HZ / 1000u)
#define DCI_ALPHA_TICKS   ((uint32_t)DCI_ALPHA_MS   * (uint32_t)FOC_ISR_HZ / 1000u)
#define DCI_SPEED_WIN_TICKS ((uint32_t)DCI_SPEED_WIN_MS * (uint32_t)FOC_ISR_HZ / 1000u)
#define DCI_PP_WIN_TICKS  ((uint32_t)DCI_PP_WIN_MS  * (uint32_t)FOC_ISR_HZ / 1000u)
#define DCI_MEAN_WIN_TICKS ((uint32_t)DCI_MEAN_WIN_MS * (uint32_t)FOC_ISR_HZ / 1000u)
#define DCI_ERR_WIN_TICKS ((uint32_t)DCI_ERR_WIN_MS  * (uint32_t)FOC_ISR_HZ / 1000u)

/* 角度换算（观测/控制用） */
#define DCI_RAD2DEG   57.2958f
#define DCI_DEG2RAD   0.0174533f

/*******************************************************************************
 * Watch 观测量 / 可调变量
 ******************************************************************************/
volatile float    g_dci_dlt_init_deg = 90.0f;   /* 功角爬坡起点（软吸附起步） */
volatile float    g_dci_dlt_targ_deg = 90.0f;  /* 功角爬坡终点 */
volatile uint32_t g_dci_dlt_tr_ms   = 0u;   /* 功角爬坡过渡时间 */
volatile float    g_dci_volt_v      = 0.8f;    /* 电压（=调速旋钮），Start 复位 */
volatile uint8_t  g_dci_running     = 0u;
volatile uint8_t  g_dci_variant     = DCI_VARIANT_FULL;  /* 当前变体（24=CAL/28=FULL/29=RUN） */
volatile uint8_t  g_dcal_offset_valid = 0u;              /* 1 = 校准 offset 已锁定（粘滞） */
volatile uint8_t  g_dci_state       = DCI_STEP_IDLE;
volatile uint8_t  g_dci_evt         = 0u;
volatile int32_t  g_dci_offset      = 0;
volatile float    g_dci_dlt_now_deg = 0.0f;
volatile float    g_dci_speed_hz    = 0.0f;
volatile int32_t  g_dci_field_deg   = 0;
volatile int32_t  g_dci_rotor_deg   = 0;
volatile int32_t  g_dci_diff_deg    = 0;
volatile float    g_dci_id_ma       = 0.0f;
volatile float    g_dci_iq_ma       = 0.0f;
volatile float    g_dci_id_pp_ma    = 0.0f;  /* id 峰峰值 (mA, 每 DCI_PP_WIN_MS 刷新) */
volatile float    g_dci_iq_pp_ma    = 0.0f;  /* iq 峰峰值 (mA, 同上) */
volatile float    g_dci_id_mean_ma  = 0.0f;  /* id 均值 (mA, 每 DCI_MEAN_WIN_MS 刷新) */
volatile float    g_dci_iq_mean_ma  = 0.0f;  /* iq 均值 (mA, 同上) */
volatile float    g_dci_i_ref_ma    = DCI_I_REF_MA;  /* 电流矢量幅值参考 (Start 不复位) */
volatile float    g_dci_id_ref_ma   = 0.0f;  /* d 轴电流参考 (mA, 实时) */
volatile float    g_dci_iq_ref_ma   = 0.0f;  /* q 轴电流参考 (mA, 实时) */
volatile uint8_t  g_dci_vsat        = 0u;    /* 电压饱和标志 (1 = 任一轴顶到 UMAX) */
volatile float    g_dci_ed_mean_ma  = 0.0f;  /* d 轴误差均值 (mA, 每 DCI_ERR_WIN_MS 刷新) */
volatile float    g_dci_eq_mean_ma  = 0.0f;  /* q 轴误差均值 (mA, 同上) */
volatile float    g_dci_ed_pp_ma    = 0.0f;  /* d 轴误差峰峰值 (mA, 同上) */
volatile float    g_dci_eq_pp_ma    = 0.0f;  /* q 轴误差峰峰值 (mA, 同上) */
volatile int32_t  g_dci_enc_pos     = 0;
volatile float    g_dci_du          = 50.0f;
volatile float    g_dci_dv          = 50.0f;
volatile float    g_dci_dw          = 50.0f;

/* 内部状态 */
static uint32_t s_phase_tick  = 0u;    /* 校准阶段计时（tick） */
static uint32_t s_run_tick    = 0u;    /* RUN 态计时（tick），爬坡时基 */
static uint8_t  s_ramp_done   = 0u;    /* 爬坡完成事件已置位（每次运行只置一次） */
static uint16_t s_enc_prev_hw = 0u;    /* 上拍编码器硬件计数 */
static int32_t  s_enc_pos     = 0;     /* 相对计数累积（限幅后） */
static uint8_t  s_enc_init    = 0u;    /* 首拍基准初始化标志 */
static int32_t  s_off_rel     = 0;     /* 锁零点瞬间的相对计数（控制帧零点） */
static uint32_t s_speed_tick  = 0u;    /* 转速窗口计时（tick） */
static int32_t  s_speed_acc   = 0;     /* 转速窗口内计数累积 */

/* id/iq 峰峰值统计（仅 RUN 态喂数，窗口无缝衔接） */
static uint32_t s_pp_tick = 0u;        /* 窗口计时（tick） */
static uint8_t  s_pp_init = 0u;        /* 首样本初始化标志 */
static float    s_id_min  = 0.0f;
static float    s_id_max  = 0.0f;
static float    s_iq_min  = 0.0f;
static float    s_iq_max  = 0.0f;

/* id/iq 均值统计（仅 RUN 态喂数，mA 整数累加避免浮点累积误差：
 * 60000 样本 × ±10000mA 上限 = 6e8，int32 范围内） */
static uint32_t s_mean_tick  = 0u;     /* 窗口计时（tick） */
static int32_t  s_id_sum_ma  = 0;      /* 窗口内 id 累加 (mA) */
static int32_t  s_iq_sum_ma  = 0;      /* 窗口内 iq 累加 (mA) */

/* 误差统计（e = ref - fb，仅 RUN 态喂数，5s 窗口无缝衔接）：
 * mean = P-only 稳态落差（应随 kp 加倍约减半）；pp = 振铃/振荡指标 */
static uint32_t s_err_tick   = 0u;     /* 窗口计时（tick） */
static uint8_t  s_err_init   = 0u;     /* 首样本初始化标志 */
static int32_t  s_ed_sum_ma  = 0;      /* 窗口内 ed 累加 (mA) */
static int32_t  s_eq_sum_ma  = 0;      /* 窗口内 eq 累加 (mA) */
static float    s_ed_min     = 0.0f;
static float    s_ed_max     = 0.0f;
static float    s_eq_min     = 0.0f;
static float    s_eq_max     = 0.0f;

