HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_dci.c
    if (variant == DCI_VARIANT_CAL) {
        DCI_DBG("cal-only start (mode 24): zero-offset -> BETA -> ALPHA -> lock -> auto mode 0");
    } else {
        DCI_DBG("start calib zero-offset -> run dlt %d->%d deg tr=%d ms Iref=%d mA kp=%d m iValid=%d",
                (int)g_dci_dlt_init_deg, (int)g_dci_dlt_targ_deg,
                (int)g_dci_dlt_tr_ms, (int)g_dci_i_ref_ma,
                (int)(g_dci_pid_iq_cfg.kp * 1000.0f),
                (int)g_dci_pid_iq_cfg.i_valid);
    }
}

/*******************************************************************************
 * Foc_Dci_Start - mode 28 入口（FULL 变体：校准 + 闭环 一体化）
 ******************************************************************************/
void Foc_Dci_Start(void)
{
    Foc_Dci_StartWithVariant(DCI_VARIANT_FULL);
}

/*******************************************************************************
 * Foc_Dcal24_Start - mode 24 入口（CAL 变体：仅校准，锁完自动回 mode 0）
 *   完成后转子可随意捏住/移动——offset 是零点基准，与当前位置无关。
 ******************************************************************************/
void Foc_Dcal24_Start(void)
{
    Foc_Dci_StartWithVariant(DCI_VARIANT_CAL);
}

/*******************************************************************************
 * Foc_Drun29_Start - mode 29 入口（RUN 变体：跳过校准，直接电流环）
 *   前置：foc_calib 已锁定 且 g_dcal_offset_valid=1（先跑 mode 24 或 28）。
 *   编码器帧锚定：s_enc_pos 从 0 起算，s_off_rel 使 Start 瞬间
 *   rel = mod(hw_now×dir − g_dci_offset, CPR)（当前真实相对电角度）。
 ******************************************************************************/
void Foc_Drun29_Start(void)
{
    uint16_t hw_now;
    int32_t rel_start;

    if (!Foc_Calib_IsLocked() || (g_dcal_offset_valid == 0u)) {
        DCI_DBG("ERROR: calib/offset not locked, run mode 24 (or 28) first");
        g_dci_state = DCI_STEP_IDLE;
        return;
    }

    Foc_Core_ClearFault();
    g_foc_mode        = FOC_MODE_ALIGN;   /* 复用 ALIGN 分发路径（按 g_dci_running 区分） */
    g_foc_phase       = 4u;
    g_foc_theta_rad   = FOC_MATH_HALF_PI;
    g_foc_id_ma       = 0.0f;
    g_foc_iq_ma       = 0.0f;
    g_foc_vd          = 0.0f;
    g_foc_vq          = 0.0f;

    Foc_Core_SetStateMachine(FOC_STATE_ALIGN);
    Foc_Core_ResetVoltageEnvelope();
    Foc_Core_ResetEma();
    g_foc_align_state = 1u;

    /* 编码器帧锚定（不重新校准，复用 mode 24/28 锁定的零偏与 offset） */
    hw_now    = TMRA_GetCountValue(CM_TMRA_1);
    rel_start = Foc_Core_ModPos((int32_t)hw_now * (int32_t)g_foc_enc_dir
                                - (int32_t)g_dci_offset, (int32_t)ENCODER_CPR);
    s_enc_pos     = 0;
    s_enc_prev_hw = hw_now;
    s_enc_init    = 1u;
    s_off_rel     = Foc_Core_ModPos(-rel_start * (int32_t)g_foc_enc_dir,
                                    (int32_t)ENCODER_CPR);

    s_run_tick        = 0u;
    s_ramp_done       = 0u;
    s_speed_tick      = 0u;
    s_speed_acc       = 0;
    g_dci_dlt_now_deg = g_dci_dlt_init_deg;
    g_dci_speed_hz    = 0.0f;
    g_dci_field_deg   = 0;
    g_dci_rotor_deg   = 0;
    g_dci_diff_deg    = 0;
    g_dci_id_ma       = 0.0f;
    g_dci_iq_ma       = 0.0f;
    g_dci_id_pp_ma    = 0.0f;
    g_dci_iq_pp_ma    = 0.0f;
    g_dci_id_mean_ma  = 0.0f;
    g_dci_iq_mean_ma  = 0.0f;
    g_dci_id_ref_ma   = 0.0f;
    g_dci_iq_ref_ma   = 0.0f;
    g_dci_vsat        = 0u;
    g_dci_ed_mean_ma  = 0.0f;
    g_dci_eq_mean_ma  = 0.0f;
    g_dci_ed_pp_ma    = 0.0f;
    g_dci_eq_pp_ma    = 0.0f;
    s_pp_tick         = 0u;
    s_pp_init         = 0u;
    s_mean_tick       = 0u;
    s_id_sum_ma       = 0;
    s_iq_sum_ma       = 0;
    s_err_tick        = 0u;
    s_err_init        = 0u;
    s_ed_sum_ma       = 0;
    s_eq_sum_ma       = 0;
    /* g_dci_i_ref_ma / 功角三参数 不复位（预设后启动） */
    PID_Reset(&s_pid_id);
    PID_Reset(&s_pid_iq);
    g_dci_enc_pos     = 0;

    g_dci_variant     = DCI_VARIANT_RUN;
    g_dci_running     = 1u;
    g_dci_state       = DCI_STEP_RUN;
    Foc_Core_PwmStart();   /* 起 PWM，下一拍直接进 RUN 电流环 */

    DCI_DBG("run-only start (mode 29): rel=%d deg dlt %d->%d deg tr=%d ms Iref=%d mA kp=%d m iValid=%d",
            (int)((int32_t)rel_start * 360 / (int32_t)ENCODER_CPR),
            (int)g_dci_dlt_init_deg, (int)g_dci_dlt_targ_deg,
            (int)g_dci_dlt_tr_ms, (int)g_dci_i_ref_ma,
            (int)(g_dci_pid_iq_cfg.kp * 1000.0f),
            (int)g_dci_pid_iq_cfg.i_valid);
}

/*******************************************************************************
 * Foc_Dci_Step - 步进（20 kHz ISR 中调用，禁止打印）
 ******************************************************************************/
void Foc_Dci_Step(const stc_i_data_t *pData)
{
    float rot_rad, id, iq, w, dlt, dlt_rad;
    float id_ref, iq_ref, vd, vq, valpha, vbeta, du, dv, dw, cos_r, sin_r;
    uint16_t hw, hw0;
    uint32_t tr_ticks;
    int32_t delta, rel, rot_deg, fld_deg, dfd, dir;
    stc_i_data_t dataCal;   /* 零偏校正后的电流采样副本（OC 保护仍用原始 pData） */

    /* ===== OC 保护（原始 pData，去抖在 Foc_Core_OverCurrent 内） ===== */
    if (Foc_Core_OverCurrent(pData)) {
        g_dci_state   = DCI_STEP_FAULT_OC;
        g_dci_evt     = DCI_EVT_OC;
        g_dci_running = 0u;
        Foc_Core_FaultStop(1u);   /* 置故障 + 关 PWM + active=0 + IDLE */
        return;
    }

    /* ===== 零偏校正副本（foc_calib 未锁定时全 0 偏移 = 原始值） ===== */
    dataCal = *pData;
    if (Foc_Calib_IsLocked()) {
        float off_u, off_v, off_w;
        Foc_Calib_GetOffsetsMa(&off_u, &off_v, &off_w);
        dataCal.i16IU_mA = (int16_t)((float)pData->i16IU_mA - off_u);
        dataCal.i16IV_mA = (int16_t)((float)pData->i16IV_mA - off_v);
        dataCal.i16IW_mA = (int16_t)((float)pData->i16IW_mA - off_w);
    }

    switch (g_dci_state) {
    /* ===== 零矢量零偏校准：三相 50/50/50（零电流），~210ms ===== */
    case DCI_STEP_CALIB:
        (void)Foc_Calib_Feed(pData);
        TMR4_PWM_SetDuty3Phase(50.0f, 50.0f, 50.0f);
        g_foc_du = 50.0f;
        g_foc_dv = 50.0f;
        g_foc_dw = 50.0f;
        g_dci_du = 50.0f;
        g_dci_dv = 50.0f;
        g_dci_dw = 50.0f;
        g_foc_id_ma = 0.0f;
        g_foc_iq_ma = 0.0f;
        g_foc_vd = 0.0f;
        g_foc_vq = 0.0f;
        if (Foc_Calib_IsLocked()) {
            s_phase_tick = 0u;
            g_dci_state  = DCI_STEP_CAL_BETA;
            g_dci_evt    = DCI_EVT_CALIB_DONE;
        }
        break;

    /* ===== 校准 BETA：磁场定 90°，2s ===== */
    case DCI_STEP_CAL_BETA:
        Dci_OutputField(&dataCal, FOC_MATH_HALF_PI);
        if (++s_phase_tick >= DCI_BETA_TICKS) {
            s_phase_tick = 0u;
            g_dci_state  = DCI_STEP_CAL_ALPHA;
            g_dci_evt    = DCI_EVT_BETA_DONE;
        }
        break;

    /* ===== 校准 ALPHA：磁场定 0°，2s，结束锁零点 -> 功角闭环 ===== */
    case DCI_STEP_CAL_ALPHA:
        Dci_OutputField(&dataCal, 0.0f);
        if (++s_phase_tick >= DCI_ALPHA_TICKS) {
            /* 锁零点（双帧）：
             *  - 控制帧：s_off_rel = 此刻相对计数，RUN 态转子电角 =
             *    mod((s_enc_pos - s_off_rel) × dir, CPR)，锁相瞬间 = 0
             *  - 显示帧：g_dci_offset = hw 绝对帧（与 mode 20/25/26/27 同框架，
             *    便于跨模式/跨次对比） */
            hw0 = TMRA_GetCountValue(CM_TMRA_1);
            dir = (int32_t)g_foc_enc_dir;
            g_dci_offset = Foc_Core_ModPos((int32_t)hw0 * dir,
                                           (int32_t)ENCODER_CPR);
            Foc_Core_SetAlignOffset(g_dci_offset);   /* core 共享角度观测同帧（与 mode 27 一致） */
            s_off_rel     = s_enc_pos;
            s_enc_prev_hw = hw0;      /* 编码器基准锚定在锁零点瞬间 */
            s_enc_init    = 1u;
            g_dcal_offset_valid = 1u; /* offset 已锁定（mode 24/28 共用粘滞标志） */

            if (g_dci_variant == DCI_VARIANT_CAL) {
                /* mode 24：校准完成即收工，foc_obs 打印后自动回 mode 0。
                 * 此后转子可随意捏住/移动——offset 是零点基准，与位置无关 */
                g_dci_running     = 0u;
                g_foc_align_state = 0u;
                if (g_foc_active) {
                    g_foc_active = 0u;
                    Foc_Core_PwmStop();
                    Foc_Core_SetStateMachine(FOC_STATE_IDLE);
                }
                s_phase_tick = 0u;
                g_dci_evt    = DCI_EVT_CAL24_DONE;
                break;
            }

            s_phase_tick = 0u;
            s_run_tick   = 0u;
            s_ramp_done  = 0u;
            g_dci_state  = DCI_STEP_RUN;
            g_dci_evt    = DCI_EVT_LOCKED;
        }
        break;

    /* ===== RUN：磁场 = 转子 + delta（功角闭环核心），与 mode 27 逐拍等价 ===== */
    case DCI_STEP_RUN:
        /* 1. delta 爬坡：value = init + (targ-init)×w，w = elapsed/tr 线性，
         *    init/targ/tr 每拍实时读 Watch（运行中改 = 按新值重算轨迹）。
         *    tr=0 立即到目标；到点置 RAMP_DONE 一次。 */
        tr_ticks = g_dci_dlt_tr_ms * (FOC_ISR_HZ / 1000u);
        if (tr_ticks == 0u) {
            w = 1.0f;
        } else {
            w = (float)s_run_tick / (float)tr_ticks;
            if (w > 1.0f) {
                w = 1.0f;
            }
        }
        dlt = g_dci_dlt_init_deg
            + (g_dci_dlt_targ_deg - g_dci_dlt_init_deg) * w;
        g_dci_dlt_now_deg = dlt;
        if ((s_ramp_done == 0u) && (s_run_tick >= tr_ticks)) {
            s_ramp_done = 1u;
            g_dci_evt   = DCI_EVT_RAMP_DONE;
        }
        s_run_tick++;

