HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_dci.c
        /* 2. 编码器增量读取：wrap-safe 差分 + ±DCI_ENC_DELTA_MAX 限幅
         *    （毛刺单拍污染封顶 ±32 counts ≈ ±2.8° 电角） */
        hw = TMRA_GetCountValue(CM_TMRA_1);
        if (!s_enc_init) {
            s_enc_prev_hw = hw;
            s_enc_init    = 1u;
        }
        delta = (int32_t)(int16_t)((uint16_t)hw - s_enc_prev_hw);
        s_enc_prev_hw = hw;
        if (delta > DCI_ENC_DELTA_MAX) {
            delta = DCI_ENC_DELTA_MAX;
        }
        if (delta < -DCI_ENC_DELTA_MAX) {
            delta = -DCI_ENC_DELTA_MAX;
        }
        s_enc_pos += delta;
        g_dci_enc_pos = s_enc_pos;

        /* 3. 转子真实电角度（相对帧 - 锁零点，机械圈 -> 电角度） */
        rel = Foc_Core_ModPos((s_enc_pos - s_off_rel) * (int32_t)g_foc_enc_dir,
                              (int32_t)ENCODER_CPR);
        rot_rad = (float)rel * (FOC_MATH_2PI * (float)FOC_POLE_PAIRS
                                / (float)ENCODER_CPR);
        rot_rad -= (float)((int32_t)(rot_rad * (1.0f / FOC_MATH_2PI))) * FOC_MATH_2PI;
        if (rot_rad < 0.0f) {
            rot_rad += FOC_MATH_2PI;
        }

        /* 4. 电流环反馈：真实转子系 id/iq（零偏校正后；RUN 控制系 = 转子系） */
        Foc_Core_GetDq(&dataCal, rot_rad, &id, &iq);
        g_dci_id_ma = id * 1000.0f;
        g_dci_iq_ma = iq * 1000.0f;
        g_foc_id_ma = g_dci_id_ma;
        g_foc_iq_ma = g_dci_iq_ma;
        Dci_PpFeed(id, iq);   /* 峰峰值统计（5s 窗口刷新） */

        /* 5. 均值统计（3s 窗口刷新，mA 整数累加无浮点误差） */
        s_id_sum_ma += (int32_t)(id * 1000.0f);
        s_iq_sum_ma += (int32_t)(iq * 1000.0f);
        if (++s_mean_tick >= DCI_MEAN_WIN_TICKS) {
            s_mean_tick = 0u;
            g_dci_id_mean_ma = (float)s_id_sum_ma / (float)DCI_MEAN_WIN_TICKS;
            g_dci_iq_mean_ma = (float)s_iq_sum_ma / (float)DCI_MEAN_WIN_TICKS;
            s_id_sum_ma = 0;
            s_iq_sum_ma = 0;
        }

        /* 6. 电流参考生成：id_ref = I_ref·cosδ, iq_ref = I_ref·sinδ
         *    （δ = 参考电流矢量方向；δ=90° 即 id_ref=0 的经典 FOC） */
        dlt_rad = dlt * DCI_DEG2RAD;
        id_ref = (g_dci_i_ref_ma * 0.001f) * Foc_Math_Cos(dlt_rad);
        iq_ref = (g_dci_i_ref_ma * 0.001f) * Foc_Math_Sin(dlt_rad);
        g_dci_id_ref_ma = id_ref * 1000.0f;
        g_dci_iq_ref_ma = iq_ref * 1000.0f;

        /* 7. PI 电流环（I 已启用）：vd/vq = PID(ref, fb)，限幅 ±DCI_PI_UMAX_V。
         *    ki≈kp×R/L 零极点对消；调 P 时 Watch 置 g_dci_pid_*_cfg.i_valid=0 */
        vd = PID_UpdateUs(&s_pid_id, id_ref, id, FOC_ISR_DT_US);
        vq = PID_UpdateUs(&s_pid_iq, iq_ref, iq, FOC_ISR_DT_US);
        g_foc_vd = vd;
        g_foc_vq = vq;
        g_dci_vsat = ((vd <= -DCI_PI_UMAX_V + 0.01f) || (vd >= DCI_PI_UMAX_V - 0.01f) ||
                      (vq <= -DCI_PI_UMAX_V + 0.01f) || (vq >= DCI_PI_UMAX_V - 0.01f)) ? 1u : 0u;

        /* 8. 反 Park（转子角）-> SVPWM 输出 */
        cos_r = Foc_Math_Cos(rot_rad);
        sin_r = Foc_Math_Sin(rot_rad);
        valpha = vd * cos_r - vq * sin_r;
        vbeta  = vd * sin_r + vq * cos_r;
        Foc_Svpwm(valpha, vbeta, FOC_VBUS_V, &du, &dv, &dw);
        TMR4_PWM_SetDuty3Phase(du, dv, dw);

        g_foc_valpha    = valpha;
        g_foc_vbeta     = vbeta;
        g_foc_theta_rad = rot_rad;   /* RUN 控制系 = 转子系 */
        g_foc_du = du;
        g_foc_dv = dv;
        g_foc_dw = dw;
        g_dci_du = du;
        g_dci_dv = dv;
        g_dci_dw = dw;

        /* 9. 误差统计（e = ref - fb，5s 窗口无缝衔接）：
         *    mean = P-only 稳态落差；pp = 振铃/振荡指标 */
        {
            int32_t e_d_ma = (int32_t)((id_ref - id) * 1000.0f);
            int32_t e_q_ma = (int32_t)((iq_ref - iq) * 1000.0f);

            if (s_err_init == 0u) {
                s_ed_min = s_ed_max = (float)e_d_ma;
                s_eq_min = s_eq_max = (float)e_q_ma;
                s_err_init = 1u;
            } else {
                if (e_d_ma < s_ed_min) { s_ed_min = (float)e_d_ma; }
                if (e_d_ma > s_ed_max) { s_ed_max = (float)e_d_ma; }
                if (e_q_ma < s_eq_min) { s_eq_min = (float)e_q_ma; }
                if (e_q_ma > s_eq_max) { s_eq_max = (float)e_q_ma; }
            }
            s_ed_sum_ma += e_d_ma;
            s_eq_sum_ma += e_q_ma;
            if (++s_err_tick >= DCI_ERR_WIN_TICKS) {
                s_err_tick = 0u;
                g_dci_ed_mean_ma = (float)s_ed_sum_ma / (float)DCI_ERR_WIN_TICKS;
                g_dci_eq_mean_ma = (float)s_eq_sum_ma / (float)DCI_ERR_WIN_TICKS;
                g_dci_ed_pp_ma = s_ed_max - s_ed_min;
                g_dci_eq_pp_ma = s_eq_max - s_eq_min;
                s_ed_sum_ma = 0;
                s_eq_sum_ma = 0;
                s_ed_min = s_ed_max = (float)e_d_ma;   /* 新窗口从当前样本起步 */
                s_eq_min = s_eq_max = (float)e_q_ma;
            }
        }

        /* 10. 转速测量（200ms 窗口，带符号）：Hz = counts×极对数×窗口率/CPR */
        s_speed_acc += delta;
        if (++s_speed_tick >= DCI_SPEED_WIN_TICKS) {
            g_dci_speed_hz = (float)s_speed_acc * (float)FOC_POLE_PAIRS
                             * (1000.0f / (float)DCI_SPEED_WIN_MS)
                             / (float)ENCODER_CPR;
            s_speed_tick = 0u;
            s_speed_acc  = 0;
        }

        /* 11. 角度观测（整型电角度 deg）：fld = 参考电流矢量角 = rot + δ，
         *     diff = δ（参考；实际电流矢量跟踪误差看 e_d/e_q 统计） */
        fld_deg = (int32_t)((rot_rad + dlt_rad) * DCI_RAD2DEG);
        if (fld_deg >= 360) {
            fld_deg -= 360;
        }
        rot_deg = (int32_t)(rot_rad * DCI_RAD2DEG);
        dfd     = fld_deg - rot_deg;
        dfd     = 180 - Foc_Core_ModPos(180 - dfd, 360);

        g_dci_field_deg = fld_deg;
        g_dci_rotor_deg = rot_deg;
        g_dci_diff_deg  = dfd;
        break;

    case DCI_STEP_FAULT_OC:
    default:
        /* 故障/未知状态：不发波，等待主循环切模式 */
        break;
    }
}

/*******************************************************************************
 * Foc_Dci_Stop - 停止（用户中途切模式，主循环上下文）
 *   自带 g_foc_active 清零，保证任何退出路径 ISR 都不会再进入本模块步进。
 ******************************************************************************/
void Foc_Dci_Stop(void)
{
    if (g_dci_running) {
        g_dci_running     = 0u;
        g_foc_align_state = 0u;
        if (g_foc_active) {
            g_foc_active = 0u;
            Foc_Core_PwmStop();
            Foc_Core_SetStateMachine(FOC_STATE_IDLE);
        }
        DCI_DBG("stopped");
    }
}
